In [2]:
import pandas as pd
import numpy as np
import requests
from io import StringIO

url = "https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv"
headers = {"User-Agent": "Mozilla/5.0 (Macintosh; Intel Mac OS X 10.14; rv:66.0) Gecko/20100101 Firefox/66.0"}
req = requests.get(url, headers=headers)
print(req)
data = StringIO(req.text)
print(data)

pd.read_csv(data)

<Response [200]>
<_io.StringIO object at 0x000002D1A7151180>

       Country         Region
0      Algeria         AFRICA
1       Angola         AFRICA
2        Benin         AFRICA
3     Botswana         AFRICA
4      Burkina         AFRICA
..         ...            ...
189   Paraguay  SOUTH AMERICA
190       Peru  SOUTH AMERICA
191   Suriname  SOUTH AMERICA
192    Uruguay  SOUTH AMERICA
193  Venezuela  SOUTH AMERICA

[194 rows x 2 columns]

# create by random production

In [3]:
from datetime import datetime, timedelta
import random

#set random seed for reproducibility
np.random.seed(42)
random.seed(42)

#generate data
ids= range(1,101)
names= [f'Emplyee_{i}' for i in range(1,101)]  # simple name format
ages = np.random.randint(22,60,size=100)
salary = np.random.randint(30000,120000,size=100)
departments = random.choices(['HR','IT','Finanace','Marketing','Operations'],k=100)
join_dates = [datetime(2020,1,1)+timedelta(days=random.randint(0,1825)) for _ in range(100)]

#Create dataframe
df=pd.DataFrame ({
    'Ids': ids,
    'Names': names,
    'Ages' : ages,
    'Salary' : salary,
    'Departments': departments,
    'Join_dates' :join_dates,
})
df

    Ids        Names  Ages  Salary Departments Join_dates
0     1    Emplyee_1    50  100592   Marketing 2020-01-24
1     2    Emplyee_2    36   38110          HR 2023-10-25
2     3    Emplyee_3    29  109309          IT 2024-01-16
3     4    Emplyee_4    42   57266          IT 2020-08-22
4     5    Emplyee_5    40   82992   Marketing 2023-10-28
..  ...          ...   ...     ...         ...        ...
95   96   Emplyee_96    58   72107          IT 2021-04-05
96   97   Emplyee_97    56  116202  Operations 2020-05-11
97   98   Emplyee_98    43   81663    Finanace 2021-11-23
98   99   Emplyee_99    48   45708  Operations 2020-02-13
99  100  Emplyee_100    56   79811  Operations 2023-04-19

[100 rows x 6 columns]

In [4]:
df.head()

   Ids      Names  Ages  Salary Departments Join_dates
0    1  Emplyee_1    50  100592   Marketing 2020-01-24
1    2  Emplyee_2    36   38110          HR 2023-10-25
2    3  Emplyee_3    29  109309          IT 2024-01-16
3    4  Emplyee_4    42   57266          IT 2020-08-22
4    5  Emplyee_5    40   82992   Marketing 2023-10-28

#### .head()- to  display top rows (default5)

#### .tail()-bottom rows(5)

In [5]:
df.tail()

    Ids        Names  Ages  Salary Departments Join_dates
95   96   Emplyee_96    58   72107          IT 2021-04-05
96   97   Emplyee_97    56  116202  Operations 2020-05-11
97   98   Emplyee_98    43   81663    Finanace 2021-11-23
98   99   Emplyee_99    48   45708  Operations 2020-02-13
99  100  Emplyee_100    56   79811  Operations 2023-04-19

#### .sample()- choose one random row (1)

In [6]:
df.sample(10)

    Ids        Names  Ages  Salary Departments Join_dates
44   45   Emplyee_45    35   96842          HR 2021-10-25
33   34   Emplyee_34    25   78925  Operations 2023-06-01
29   30   Emplyee_30    28   79080   Marketing 2021-09-03
99  100  Emplyee_100    56   79811  Operations 2023-04-19
69   70   Emplyee_70    50   97172          IT 2023-09-13
92   93   Emplyee_93    54  110623   Marketing 2022-07-13
25   26   Emplyee_26    37   52299          IT 2022-11-05
9    10   Emplyee_10    57  117897          HR 2024-04-23
54   55   Emplyee_55    55   96199   Marketing 2020-04-28
87   88   Emplyee_88    28   97863    Finanace 2023-10-07

#### .ino()- it displays overall info about Dataframe

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Ids          100 non-null    int64
 1   Names        100 non-null    object
 2   Ages         100 non-null    int32
 3   Salary       100 non-null    int32
 4   Departments  100 non-null    object
 5   Join_dates   100 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int32(2), int64(1), object(2)
memory usage: 4.0+ KB

#### .descrieb()- statistical info

In [8]:
df.describe()

              Ids        Ages         Salary           Join_dates
count  100.000000  100.000000     100.000000                  100
mean    50.500000   40.060000   77618.640000  2022-07-19 20:09:36
min      1.000000   22.000000   30206.000000  2020-01-02 00:00:00
25%     25.750000   30.000000   55302.500000  2021-03-29 06:00:00
50%     50.500000   41.500000   80747.500000  2022-09-24 12:00:00
75%     75.250000   48.000000   97182.500000  2023-11-01 00:00:00
max    100.000000   59.000000  119474.000000  2024-12-17 00:00:00
std     29.011492   10.688255   25454.250799                  NaN

In [9]:
df.describe(include='all')

,Ids,Names,Ages,Salary,Departments,Join_dates
count,100.000000,100,100.000000,100.000000,100,100
unique,NaN,100,NaN,NaN,5,NaN
top,NaN,Emplyee_1,NaN,NaN,IT,NaN
freq,NaN,1,NaN,NaN,28,NaN
mean,50.500000,NaN,40.060000,77618.640000,NaN,2022-07-19 20:09:36
min,1.000000,NaN,22.000000,30206.000000,NaN,2020-01-02 00:00:00
25%,25.750000,NaN,30.000000,55302.500000,NaN,2021-03-29 06:00:00
50%,50.500000,NaN,41.500000,80747.500000,NaN,2022-09-24 12:00:00
75%,75.250000,NaN,48.000000,97182.500000,NaN,2023-11-01 00:00:00
max,100.000000,NaN,59.000000,119474.000000,NaN,2024-12-17 00:00:00
std,29.011492,NaN,10.688255,25454.250799,NaN,NaN

# for import csv files
- pd.read_csv()

In [31]:
aug_train = pd.read_csv('aug_train.csv')
aug_train.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

In [32]:
aug_train.set_index(['enrollee_id']).sort_index(ascending=False)

,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
enrollee_id,,,,,,,,,,,,,
33380,city_83,0.923,Male,No relevent experience,no_enrollment,Graduate,STEM,14,10000+,Pvt Ltd,2,168,0.0
33379,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,18,<10,Pvt Ltd,2,81,0.0
33377,city_65,0.802,Male,Has relevent experience,no_enrollment,Graduate,Other,10,100-500,Pvt Ltd,2,27,0.0
33376,city_16,0.910,Female,Has relevent experience,no_enrollment,Masters,Business Degree,8,1000-4999,Public Sector,4,74,0.0
33375,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,16,50-99,Public Sector,1,51,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
7,city_136,0.897,Male,Has relevent experience,Full time course,Masters,STEM,13,NaN,NaN,1,18,0.0
5,city_67,0.855,Male,Has relevent experience,no_enrollment,Masters,STEM,10,<10,Early Stage Startup,1,12,0.0
4,city_103,0.920,Male,No relevent experience,no_enrollment,Masters,STEM,9,50-99,Public Sector,>4,13,0.0
2,city_103,0.920,Male,No relevent experience,no_enrollment,Phd,STEM,15,10000+,NGO,3,128,1.0
1,city_103,0.920,Male,No relevent experience,no_enrollment,High School,NaN,2,NaN,Pvt Ltd,never,150,0.0

In [37]:
aug_train.sort_values(by=['city','gender'],ascending=[True,False])

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
3015,27562,city_1,0.847,Male,No relevent experience,Full time course,Graduate,STEM,2,NaN,NaN,never,7,1.0
3241,22126,city_1,0.847,Male,Has relevent experience,Full time course,Masters,STEM,6,10/49,NaN,1,3,0.0
3393,26884,city_1,0.847,Male,Has relevent experience,no_enrollment,Graduate,STEM,15,10000+,NaN,3,35,0.0
4669,14020,city_1,0.847,Male,Has relevent experience,no_enrollment,Masters,STEM,10,50-99,Pvt Ltd,1,59,0.0
5240,21068,city_1,0.847,Male,Has relevent experience,no_enrollment,NaN,NaN,19,10/49,Pvt Ltd,>4,30,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13881,1676,city_99,0.915,NaN,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Pvt Ltd,2,39,0.0
14078,10121,city_99,0.915,NaN,Has relevent experience,no_enrollment,Masters,STEM,17,50-99,Pvt Ltd,1,6,0.0
17097,10210,city_99,0.915,NaN,Has relevent experience,no_enrollment,Graduate,STEM,4,<10,Early Stage Startup,1,69,0.0
17822,6363,city_99,0.915,NaN,Has relevent experience,Full time course,Graduate,STEM,5,10000+,Public Sector,1,26,0.0
19119,935,city_99,0.915,NaN,Has relevent experience,Full time course,Graduate,STEM,5,10/49,NaN,2,42,0.0

In [39]:
rows = aug_train.shape[0]
cols = aug_train.shape[1]
print(f'There are total {cols} columns and {rows} rows')

There are total 14 columns and 19158 rows

# Checking Null Values

In [51]:
abc = aug_train.isnull().sum(axis=1)/aug_train.shape[1]*100
abc.sort_values(ascending= False)

1376     50.0
17977    50.0
12348    50.0
10337    50.0
13236    50.0
         ...
10198     0.0
4         0.0
19155     0.0
19152     0.0
19150     0.0
Length: 19158, dtype: float64

In [45]:
aug_train.isnull().sum(axis=0)/len(aug_train)*100

enrollee_id                0.000000
city                       0.000000
city_development_index     0.000000
gender                    23.530640
relevent_experience        0.000000
enrolled_university        2.014824
education_level            2.401086
major_discipline          14.683161
experience                 0.339284
company_size              30.994885
company_type              32.049274
last_new_job               2.207955
training_hours             0.000000
target                     0.000000
dtype: float64

In [43]:
aug_train[aug_train.isnull().sum(axis=1)== len(aug_train)]

Empty DataFrame
Columns: [enrollee_id, city, city_development_index, gender, relevent_experience, enrolled_university, education_level, major_discipline, experience, company_size, company_type, last_new_job, training_hours, target]
Index: []

In [11]:
movies = pd.read_csv('movie_titles_metadata.tsv',sep='\t'
                     ,names=['SN','Title','Year','Rating','Review','Genre'],index_col="SN")
movies

,Title,Year,Rating,Review,Genre
SN,,,,,
m0,10 things i hate about you,1999,6.9,62847,['comedy' 'romance']
m1,1492: conquest of paradise,1992,6.2,10421,['adventure' 'biography' 'drama' 'history']
m2,15 minutes,2001,6.1,25854,['action' 'crime' 'drama' 'thriller']
m3,2001: a space odyssey,1968,8.4,163227,['adventure' 'mystery' 'sci-fi']
m4,48 hrs.,1982,6.9,22289,['action' 'comedy' 'crime' 'drama' 'thriller']
...,...,...,...,...,...
m612,watchmen,2009,7.8,135229,['action' 'crime' 'fantasy' 'mystery' 'sci-fi'...
m613,xxx,2002,5.6,53505,['action' 'adventure' 'crime']
m614,x-men,2000,7.4,122149,['action' 'sci-fi']
m615,young frankenstein,1974,8.0,57618,['comedy' 'sci-fi']
m616,zulu dawn,1979,6.4,1911,['action' 'adventure' 'drama' 'history' 'war']

In [12]:
movies[movies['Title'].isnull()]

Empty DataFrame
Columns: [Title, Year, Rating, Review, Genre]
Index: []

In [13]:
aug_train = pd.read_csv('aug_train.csv',index_col='enrollee_id',
                         usecols=['enrollee_id','city','city_development_index','gender'])
aug_train

                 city  city_development_index gender
enrollee_id
8949         city_103                   0.920   Male
29725         city_40                   0.776   Male
11561         city_21                   0.624    NaN
33241        city_115                   0.789    NaN
666          city_162                   0.767   Male
...               ...                     ...    ...
7386         city_173                   0.878   Male
31398        city_103                   0.920   Male
24576        city_103                   0.920   Male
5756          city_65                   0.802   Male
23834         city_67                   0.855    NaN

[19158 rows x 3 columns]

In [14]:
pd.read_csv('aug_train.csv',nrows=100)

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,12081,city_65,0.802,Male,Has relevent experience,Full time course,Graduate,STEM,9,50-99,Pvt Ltd,1,33,0.0
96,7364,city_160,0.920,NaN,No relevent experience,Full time course,High School,NaN,2,100-500,Pvt Ltd,1,142,0.0
97,11184,city_74,0.579,NaN,No relevent experience,Full time course,Graduate,STEM,2,100-500,Pvt Ltd,1,34,0.0
98,7016,city_65,0.802,Male,Has relevent experience,no_enrollment,Graduate,STEM,6,50-99,Pvt Ltd,2,14,1.0
99,8695,city_11,0.550,Male,Has relevent experience,no_enrollment,Graduate,STEM,6,10/49,Pvt Ltd,2,27,1.0

In [15]:
ipl=pd.read_csv("IPL Matches 2008-2020.csv",parse_dates=['date'])
ipl.head()

,id,city,date,player_of_match,venue,neutral_venue,team1,team2,toss_winner,toss_decision,winner,result,result_margin,eliminator,method,umpire1,umpire2
0,335982,Bangalore,2008-04-18,BB McCullum,M Chinnaswamy Stadium,0,Royal Challengers Bangalore,Kolkata Knight Riders,Royal Challengers Bangalore,field,Kolkata Knight Riders,runs,140.0,N,NaN,Asad Rauf,RE Koertzen
1,335983,Chandigarh,2008-04-19,MEK Hussey,"Punjab Cricket Association Stadium, Mohali",0,Kings XI Punjab,Chennai Super Kings,Chennai Super Kings,bat,Chennai Super Kings,runs,33.0,N,NaN,MR Benson,SL Shastri
2,335984,Delhi,2008-04-19,MF Maharoof,Feroz Shah Kotla,0,Delhi Daredevils,Rajasthan Royals,Rajasthan Royals,bat,Delhi Daredevils,wickets,9.0,N,NaN,Aleem Dar,GA Pratapkumar
3,335985,Mumbai,2008-04-20,MV Boucher,Wankhede Stadium,0,Mumbai Indians,Royal Challengers Bangalore,Mumbai Indians,bat,Royal Challengers Bangalore,wickets,5.0,N,NaN,SJ Davis,DJ Harper
4,335986,Kolkata,2008-04-20,DJ Hussey,Eden Gardens,0,Kolkata Knight Riders,Deccan Chargers,Deccan Chargers,bat,Kolkata Knight Riders,wickets,5.0,N,NaN,BF Bowden,K Hariharan

In [16]:
ipl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 816 entries, 0 to 815
Data columns (total 17 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               816 non-null    int64
 1   city             803 non-null    object
 2   date             816 non-null    datetime64[ns]
 3   player_of_match  812 non-null    object
 4   venue            816 non-null    object
 5   neutral_venue    816 non-null    int64
 6   team1            816 non-null    object
 7   team2            816 non-null    object
 8   toss_winner      816 non-null    object
 9   toss_decision    816 non-null    object
 10  winner           812 non-null    object
 11  result           812 non-null    object
 12  result_margin    799 non-null    float64
 13  eliminator       812 non-null    object
 14  method           19 non-null     object
 15  umpire1          816 non-null    object
 16  umpire2          816 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(2), object(13)
memory usage: 108.5+ KB

In [17]:
ipl['date'].dt.year

0      2008
1      2008
2      2008
3      2008
4      2008
       ...
811    2020
812    2020
813    2020
814    2020
815    2020
Name: date, Length: 816, dtype: int32

In [18]:
ipl2=pd.read_csv('IPL Matches 2008-2020.csv')
ipl2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 816 entries, 0 to 815
Data columns (total 17 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               816 non-null    int64
 1   city             803 non-null    object
 2   date             816 non-null    object
 3   player_of_match  812 non-null    object
 4   venue            816 non-null    object
 5   neutral_venue    816 non-null    int64
 6   team1            816 non-null    object
 7   team2            816 non-null    object
 8   toss_winner      816 non-null    object
 9   toss_decision    816 non-null    object
 10  winner           812 non-null    object
 11  result           812 non-null    object
 12  result_margin    799 non-null    float64
 13  eliminator       812 non-null    object
 14  method           19 non-null     object
 15  umpire1          816 non-null    object
 16  umpire2          816 non-null    object
dtypes: float64(1), int64(2), object(14)
memory usage: 108.5+ KB

In [19]:
ipl2['date']=pd.to_datetime(ipl2['date'])

In [20]:
ipl2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 816 entries, 0 to 815
Data columns (total 17 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               816 non-null    int64
 1   city             803 non-null    object
 2   date             816 non-null    datetime64[ns]
 3   player_of_match  812 non-null    object
 4   venue            816 non-null    object
 5   neutral_venue    816 non-null    int64
 6   team1            816 non-null    object
 7   team2            816 non-null    object
 8   toss_winner      816 non-null    object
 9   toss_decision    816 non-null    object
 10  winner           812 non-null    object
 11  result           812 non-null    object
 12  result_margin    799 non-null    float64
 13  eliminator       812 non-null    object
 14  method           19 non-null     object
 15  umpire1          816 non-null    object
 16  umpire2          816 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(2), object(13)
memory usage: 108.5+ KB

#### Handline file errors while loading

In [21]:
zomato = pd.read_csv('zomato.csv',encoding='latin-1')
zomato.head()

,Restaurant ID,Restaurant Name,Country Code,City,Address,Locality,Locality Verbose,Longitude,Latitude,Cuisines,...,Currency,Has Table booking,Has Online delivery,Is delivering now,Switch to order menu,Price range,Aggregate rating,Rating color,Rating text,Votes
0,6317637,Le Petit Souffle,162,Makati City,"Third Floor, Century City Mall, Kalayaan Avenu...","Century City Mall, Poblacion, Makati City","Century City Mall, Poblacion, Makati City, Mak...",121.027535,14.565443,"French, Japanese, Desserts",...,Botswana Pula(P),Yes,No,No,No,3,4.8,Dark Green,Excellent,314
1,6304287,Izakaya Kikufuji,162,Makati City,"Little Tokyo, 2277 Chino Roces Avenue, Legaspi...","Little Tokyo, Legaspi Village, Makati City","Little Tokyo, Legaspi Village, Makati City, Ma...",121.014101,14.553708,Japanese,...,Botswana Pula(P),Yes,No,No,No,3,4.5,Dark Green,Excellent,591
2,6300002,Heat - Edsa Shangri-La,162,Mandaluyong City,"Edsa Shangri-La, 1 Garden Way, Ortigas, Mandal...","Edsa Shangri-La, Ortigas, Mandaluyong City","Edsa Shangri-La, Ortigas, Mandaluyong City, Ma...",121.056831,14.581404,"Seafood, Asian, Filipino, Indian",...,Botswana Pula(P),Yes,No,No,No,4,4.4,Green,Very Good,270
3,6318506,Ooma,162,Mandaluyong City,"Third Floor, Mega Fashion Hall, SM Megamall, O...","SM Megamall, Ortigas, Mandaluyong City","SM Megamall, Ortigas, Mandaluyong City, Mandal...",121.056475,14.585318,"Japanese, Sushi",...,Botswana Pula(P),No,No,No,No,4,4.9,Dark Green,Excellent,365
4,6314302,Sambo Kojin,162,Mandaluyong City,"Third Floor, Mega Atrium, SM Megamall, Ortigas...","SM Megamall, Ortigas, Mandaluyong City","SM Megamall, Ortigas, Mandaluyong City, Mandal...",121.057508,14.584450,"Japanese, Korean",...,Botswana Pula(P),Yes,No,No,No,4,4.8,Dark Green,Excellent,229

# To write data into csv file

In [22]:
ipl.columns

Index(['id', 'city', 'date', 'player_of_match', 'venue', 'neutral_venue',
       'team1', 'team2', 'toss_winner', 'toss_decision', 'winner', 'result',
       'result_margin', 'eliminator', 'method', 'umpire1', 'umpire2'],
      dtype='object')

In [23]:
ipl_win=ipl[['city','date','venue','winner']]
ipl_win.head(1)

        city       date                  venue                 winner
0  Bangalore 2008-04-18  M Chinnaswamy Stadium  Kolkata Knight Riders

In [24]:
ipl_win.to_csv('IPL_Win.csv',index=False)   # created csv file

In [27]:
ipl.to_excel('IPL.xlsx', index=False, sheet_name='winners')

# Excel Works

In [26]:
pd.read_excel('clinical_trials.xlsx',sheet_name='treatments')

,Unnamed: 0,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
0,0,veronika,jindrová,41u - 48u,-,7.63,7.20,NaN
1,1,elliot,richardson,-,40u - 45u,7.56,7.09,0.97
2,2,yukitaka,takenaka,-,39u - 36u,7.68,7.25,NaN
3,3,skye,gormanston,33u - 36u,-,7.97,7.62,0.35
4,4,alissa,montez,-,33u - 29u,7.78,7.46,0.32
...,...,...,...,...,...,...,...,...
275,275,albina,zetticci,45u - 51u,-,7.93,7.73,0.20
276,276,john,teichelmann,-,49u - 49u,7.90,7.58,NaN
277,277,mathea,lillebø,23u - 36u,-,9.04,8.67,0.37
278,278,vallie,prince,31u - 38u,-,7.64,7.28,0.36
279,279,samúel,guðbrandsson,53u - 56u,-,8.00,7.64,0.36

# Checking Duplicate Value

In [52]:
aug_train.duplicated().any()

np.False_

In [55]:
aug_train.drop(index=1)

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
5,21651,city_176,0.764,NaN,Has relevent experience,Part time course,Graduate,STEM,11,NaN,NaN,1,24,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14,NaN,NaN,1,42,1.0
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14,NaN,NaN,4,52,1.0
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,4,44,0.0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,<1,500-999,Pvt Ltd,2,97,0.0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2,NaN,NaN,1,127,0.0

In [56]:
aug_train.drop(columns=['enrollee_id','city'])

,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...
19153,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14,NaN,NaN,1,42,1.0
19154,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14,NaN,NaN,4,52,1.0
19155,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,4,44,0.0
19156,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,<1,500-999,Pvt Ltd,2,97,0.0
19157,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2,NaN,NaN,1,127,0.0

In [64]:
train_ind = aug_train[aug_train.drop(columns='enrollee_id').duplicated()].index # keep = false or first
train_ind

Index([  250,  3924,  4078,  4212,  4649,  5554,  6292,  6851,  7108,  7253,
        7376,  7550,  7909,  7930,  7983,  8926, 10030, 10604, 11063, 12006,
       12076, 12457, 12685, 12874, 13057, 13767, 13823, 14064, 14743, 15174,
       15180, 15264, 15443, 15535, 15552, 15991, 16151, 17232, 17348, 17552,
       17555, 17894, 18218, 18388, 18721, 18758, 19019, 19056, 19143],
      dtype='int64')

In [68]:
aug_train_clean = aug_train.drop(train_ind).reset_index(drop=True)
aug_train_clean

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19104,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14,NaN,NaN,1,42,1.0
19105,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14,NaN,NaN,4,52,1.0
19106,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,4,44,0.0
19107,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,<1,500-999,Pvt Ltd,2,97,0.0
19108,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2,NaN,NaN,1,127,0.0

# Apply boolean condition

In [76]:
# aug_train.loc[(aug_train['training_hours'] < 50) & (aug_train['target'] == 1), ['training_hours', 'target']]
aug_train[(aug_train['training_hours']<50)&(aug_train['target']==1)]

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
5,21651,city_176,0.764,NaN,Has relevent experience,Part time course,Graduate,STEM,11,NaN,NaN,1,24,1.0
7,402,city_46,0.762,Male,Has relevent experience,no_enrollment,Graduate,STEM,13,<10,Pvt Ltd,>4,18,1.0
8,27107,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,7,50-99,Pvt Ltd,1,46,1.0
10,29452,city_21,0.624,NaN,No relevent experience,Full time course,High School,NaN,2,NaN,NaN,never,32,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19136,23672,city_21,0.624,NaN,Has relevent experience,no_enrollment,Masters,STEM,6,NaN,NaN,1,5,1.0
19144,17191,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,4,NaN,NaN,never,48,1.0
19148,9212,city_21,0.624,NaN,Has relevent experience,no_enrollment,Masters,STEM,3,100-500,Pvt Ltd,3,40,1.0
19149,251,city_103,0.920,Male,Has relevent experience,no_enrollment,Masters,STEM,9,50-99,Pvt Ltd,1,36,1.0
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14,NaN,NaN,1,42,1.0

In [77]:
aug_train.query('training_hours<50 and target==0')

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
6,28806,city_160,0.920,Male,Has relevent experience,no_enrollment,High School,NaN,5,50-99,Funded Startup,1,24,0.0
12,25619,city_61,0.913,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,1000-4999,Pvt Ltd,3,23,0.0
13,5826,city_21,0.624,Male,No relevent experience,NaN,NaN,NaN,2,NaN,NaN,never,24,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19142,13750,city_40,0.776,Male,Has relevent experience,no_enrollment,NaN,NaN,5,10/49,Early Stage Startup,1,26,0.0
19143,33047,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,10000+,Pvt Ltd,>4,18,0.0
19150,32313,city_160,0.920,Female,Has relevent experience,no_enrollment,Graduate,STEM,10,100-500,Public Sector,3,23,0.0
19152,29754,city_103,0.920,Female,Has relevent experience,no_enrollment,Graduate,Humanities,7,10/49,Funded Startup,1,25,0.0
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,4,44,0.0

## To Find unique values of columns

In [80]:
aug_train['gender'].unique()

array(['Male', nan, 'Female', 'Other'], dtype=object)

In [81]:
aug_train['enrollee_id'].unique()

array([ 8949, 29725, 11561, ..., 24576,  5756, 23834], shape=(19158,))

In [82]:
aug_train['gender'].nunique()

3

In [84]:
# To check frequency of each unique values.

aug_train.gender.value_counts()

gender
Male      13221
Female     1238
Other       191
Name: count, dtype: int64

In [89]:
round(aug_train.city_development_index.mean(),2)

np.float64(0.83)